501953807/Eregen/firmware/medical-wristband/esp32s3/sdkconfig.defaults
# ESP-IDF v5.3 defaults for Eregen Medical Wristband (ESP32-S3)
CONFIG_ESP_SYSTEM_WIFI_POWEROFF_ENABLE=n
CONFIG_SPIRAM=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_NUM=1
CONFIG_ESP_CONSOLE_UART_TX_GPIO=43
CONFIG_ESP_CONSOLE_UART_RX_GPIO=44
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_FLASH_4MB=y
CONFIG_ESP32S3_FLASH_SPEED_80MHz=y
CONFIG_ESP32S3_RTC_CLK_SRC_INT_RC=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_ROLE_PERIPHERAL=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_ADV_DUP_MODE=y
CONFIG_FFS_FILE=y
CONFIG_FFS_CODECS=y
CONFIG_FFS_MEMORY_SIZE=0x10000
CONFIG_HEAP_MAIN_HEAP_SIZE=0x8000
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_MAX_SOCKETS=4
